# Built In Failures Auto Route Failures Family Symbol Nesting Elements Error Property

Source: https://www.revitapidocs.com/2026/b82dadfd-6ec5-f1e4-8a2b-eede10949859.htm

---

| Built In Failures Auto Route Failures Family Symbol Nesting Elements Error Property |
| --- |

The fitting family contains unsupported nested elements or sub\-elements. Please update the routing preference by selecting a different fitting type.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static FailureDefinitionId FamilySymbolNestingElementsError { get; }
```

```
Public Shared ReadOnly Property FamilySymbolNestingElementsError As FailureDefinitionId
	Get
```

```
public:
static property FailureDefinitionId^ FamilySymbolNestingElementsError {
	FailureDefinitionId^ get ();
}
```

```
static member FamilySymbolNestingElementsError : FailureDefinitionId with get
```

#### Property Value

FailureDefinitionId See Also

#### Reference

BuiltInFailures AutoRouteFailures Class Autodesk.Revit.DB Namespace